app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" IN (1, 2, 3, 4)
---
<% @lists.each do |list|%>
<strong> <%= list.name %> <%= list.tasks.count %></strong>