app/controllers/completed_tasks_controller.rb

  def create
    @task = Task.find(params[:id])
    @task.completed = true
    @task.save
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "tasks" SET "completed" = 't', "updated_at" = '2012-06-21 19:19:27.057235' WHERE "tasks"."id" = 8