app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'akherr@vt.edu' LIMIT 1
---
  def create
    email =
    user = User.find_by_email(params[:email])