app/controllers/tasks_controller.rb

SELECT "lists".* FROM "lists"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" IN (1, 2, 3, 4)
SELECT "users".* FROM "users"
---
  def index
    @lists = List.all(:include => :tasks)
    @task = Task.new
    @users = User.all

INSERT INTO "tasks" ("completed", "created_at", "due_at", "list_id", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["completed", false], ["created_at", Fri, 22 Jun 2012 18:27:23 UTC +00:00], ["due_at", nil], ["list_id", 3], ["name", "Fart"], ["updated_at", Fri, 22 Jun 2012 18:27:23 UTC +00:00], ["user_id", 1]]
SELECT "tasks".* FROM "tasks"
SELECT "lists".* FROM "lists"
---
  def create
    @task = Task.new(params[:task])
    if @task.save
      flash[:notice] = "Created task!"
      redirect_to tasks_path
    else
      @tasks = Task.all
      @lists = List.all

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "due_at" = '2006-06-06 00:00:00.000000', "updated_at" = '2012-06-21 19:31:47.637992' WHERE "tasks"."id" = 7
---
  def update
    @task = Task.find(params[:id])
    @lists = List.all
    if @task.update_attributes(params[:task])